Description: Downloads the latest version of the CADAbahn app. Internal use only. 
Identifier: com.github.autopkg.chalcahuite-recipes.CADAbahn.download
MinimumVersion: "2.3"

Input:
  NAME: CADABAHN
  # Download URL for the latest version of the app is a place holder for now
  DOWNLOAD_URL: https://github.com/comcast-uem-jamf/CADAbahn/releases/latest 

Process:

  - Processor: URLDownloader
    Arguments:
      url: "%match%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%"
      expected_authority_names: 
        - "Developer ID Installer: Comcast Cable Communications, Inc. (DAH86Q54R2)"
        - "Developer ID Certification Authority"
        - "Apple Root CA"

  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/CADABAHN.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString