Description: Downloads the latest version of the CADAbahn app. Internal use only. 
Identifier: com.github.autopkg.chalcahuite-recipes.CADAbahn.download
MinimumVersion: "2.3"

Input:
  NAME: CADABAHN
  # Download URL for the latest version of the app is a place holder for now
  DOWNLOAD_URL: https://github.com/comcast-uem-jamf/CADAbahn/releases/latest 

Process:

  - Processor: URLDownloader
    Arguments:
      url: "%match%"

  - Processor: EndOfCheckPhase

  - Processor: FlatPkgUnpacker
    Arguments:
      flat_pkg_path: "%pathname%"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%"
      purge_destination: TRUE

  - Processor: PkgPayloadUnpacker
    Arguments:
      pkg_payload_path: "%RECIPE_CACHE_DIR%/%NAME%/Payload"
      destination_path: "%RECIPE_CACHE_DIR%/%NAME%/unpack"
      purge_destination: TRUE

  - Processor: Versioner
    Arguments:
      input_plist_path: "%RECIPE_CACHE_DIR%/%NAME%/unpack/Applications/%NAME%.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString