Description: Downloads the latest version of the CADAbahn app. Internal use only. 
Identifier: com.github.autopkg.chalcahuite-recipes.CADAbahn.download
MinimumVersion: "2.3"

Input:
  NAME: CADABAHN
  # Download URL for the latest version of the app is a place holder for now
  DOWNLOAD_URL: https://github.com/comcast-uem-jamf/CADAbahn/releases/latest 

Process:

  - Processor: URLDownloader
    Arguments:
      url: "%match%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/CADABAHN.app"
      requirement: anchor apple generic and identifier "com.comcast.cadabahn" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = DAH86Q54R2)

  - Processor: Versioner
    Arguments:
      input_plist_path: "%pathname%/CADABAHN.app/Contents/Info.plist"
      plist_version_key: CFBundleShortVersionString