Description: Takes CADAbahn package and 
Identifier: com.github.autopkg.chalcahuite-recipes.pkg.CADAbahn
ParentRecipe: com.github.autopkg.chalcahuite-recipes.CADAbahn.download
MinimumVersion: "2.3"

Input:
  NAME: CADABAHN

Process:
  - Processor: AppPkgCreator
    Arguments: 
      app_path: "%RECIPE_CACHE_DIR%/%NAME%/unpack/%NAME%.app"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg
      