<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of the Cisco Webex Meetings and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.chalcahuite.pkg.CiscoWebexMeetings</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cisco Webex Meetings</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.chalcahuite.download.CiscoWebexMeetings</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>source_pkg</key>
				<string>%RECIPE_CACHE_DIR%/downloads/webexapp.dmg/%NAME%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>flat_pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/unpack/</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
	</array>
</dict>
</plist>
