<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>
This AutoPkg recipe was created using JSSRecipeCreator:
https://github.com/sheagcraig/JSSRecipeCreator

It is meant to be used with JSSImporter:
https://github.com/sheagcraig/JSSImporter

For tips on integrating JSSImporter into your Casper environment, check out Auto Update Magic:
https://github.com/homebysix/auto-update-magic</string>
	<key>Description</key>
	<string>Finds latest Microsoft AutoUpdate (MAU) installer, downloads the pkg. Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.githumb.autopkg.chalcahuite.jss.MAU</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Microsoft</string>
		<key>DESCRIPTION</key>
		<string>Microsoft Auto Update application for keeping Office apps up-to-date.</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/MSMAU.png</string>
		<key>NAME</key>
		<string>Microsoft MAU</string>
		<key>POLICY_CATEGORY</key>
		<string></string>
		<key>POLICY_TEMPLATE</key>
		<string>%RECIPE_DIR%/PolicyTemplate.xml</string>
		<key>pkg_path</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.1</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.arubdesu.pkg.MAU</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>MAU-update-smart</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%RECIPE_DIR%/SmartGroupTemplate.xml (DEFAULT)</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
