Comment: Recipe automatically generated from local.jss.GrandPerspective by JamfRecipeMaker
Identifier: com.github.autopkg.chalcahuite-recipes.jamf.GrandPerspective
ParentRecipe: com.github.homebysix.pkg.GrandPerspective
MinimumVersion: '2.3'

Input:
  NAME: GrandPerspective
  CATEGORY: Utility
  GROUP_NAME: GrandPerspective-update-smart
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_NAME: Install Latest %NAME%
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  SELF_SERVICE_DISPLAY_NAME: Install Latest %NAME%
  SELF_SERVICE_DESCRIPTION: GrandPerspective is a small utility application for Mac OS X that graphically shows the disk usage within a file system.
  SELF_SERVICE_ICON: '%NAME%.png'
  UPDATE_PREDICATE: pkg_uploaded == False

Process:
- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
  Arguments:
    pkg_category: '%CATEGORY%'

- Processor: StopProcessingIf
  Arguments:
    predicate: '%UPDATE_PREDICATE%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
  Arguments:
    computergroup_name: '%GROUP_NAME%'
    computergroup_template: '%GROUP_TEMPLATE%'
    replace_group: 'True'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
  Arguments:
    category_name: '%POLICY_CATEGORY%'

- Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
  Arguments:
    icon: '%SELF_SERVICE_ICON%'
    policy_name: '%POLICY_NAME%'
    policy_template: '%POLICY_TEMPLATE%'
    replace_policy: 'True'
