<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>
This AutoPkg recipe was created using JSSRecipeCreator:
https://github.com/sheagcraig/JSSRecipeCreator

It is meant to be used with JSSImporter:
https://github.com/sheagcraig/JSSImporter</string>
	<key>Description</key>
	<string>Downloads the latest version of Cisco Spark and creates a package. Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.chalcahuite.jss.CiscoSpark</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Utilities</string>
		<key>DESCRIPTION</key>
		<string>Cisco Spark brings your teams together and makes it easy to keep people and work connected. Securely send messages, share files, and meet face-to-face with anyone, anywhere, anytime.</string>
		<key>ICON</key>
		<string>%RECIPE_DIR%/Cisco Spark.png</string>
		<key>NAME</key>
		<string>Cisco Spark</string>
		<key>POLICY_CATEGORY</key>
		<string>Utilities</string>
		<key>POLICY_TEMPLATE</key>
		<string></string>
		<key>pkg_path</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.chalcahuite.pkg.CiscoSpark</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>template_path</key>
						<string>%RECIPE_DIR%/SmartGroupTemplate.xml</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
