<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of the desired major TeamViewer version and creates a pkg. Then, uploads to the Jamf Pro Server.</string>
	<key>Identifier</key>
	<string>com.github.chalcahuite.jss.TeamViewerHostCustom</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Configuration</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>TeamViewerHostCustom</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing (DEFAULT)</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Control, manage, monitor, and repair computers, mobile devices, network machines and more – from anywhere, anytime</string>
		<key>SELF_SERVICE_ICON</key>
		<string>TeamViewerHostCustom.png</string>
		<key>version</key>
		<string></string>
		<key>TEAMVIEWER_VERSION</key>
		<string>15</string>
		<key>TEAMVIEWER_CUSTOM_ID</key>
		<string>6p6z5kg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.apizz.pkg.TeamViewerHostCustom</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
